<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"a194bc81d558eb85106ecf64dc7f1dc74fcd5b4a387de1a10d4272a2b6da8511","plan_job_ref":"Job Terraform plan #24 at https://github.com/w00kster/mariokart-leaderboard/actions/runs/4976302082","plan_hash":"96592faae5d098966a1a26ea04642b9ce615bf5f2ab34272369bd232cd1eb929","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __infrastructure/mysql/__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # linode_database_mysql.mariokart-leaderboard will be created
  + resource "linode_database_mysql" "mariokart-leaderboard" {
      + allow_list       = [
          + "180.150.36.8/32",
          + "193.116.209.48/32",
          + "220.245.113.214/32",
        ]
      + ca_cert          = (sensitive value)
      + cluster_size     = 1
      + created          = (known after apply)
      + encrypted        = false
      + engine           = (known after apply)
      + engine_id        = "************"
      + host_primary     = (known after apply)
      + host_secondary   = (known after apply)
      + id               = (known after apply)
      + label            = "mariokart-leaderboard"
      + region           = "ap-southeast"
      + replication_type = "none"
      + root_password    = (sensitive value)
      + root_username    = (sensitive value)
      + ssl_connection   = true
      + status           = (known after apply)
      + type             = "g6-nanode-1"
      + updated          = (known after apply)
      + version          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #24](https://github.com/w00kster/mariokart-leaderboard/actions/runs/4976302082)